SET NAMES 'utf8';
DROP DATABASE IF EXISTS case_new;
CREATE DATABASE case_new CHARSET=UTF8;
USE case_new;

CREATE TABLE case_dish(
    did INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(64),
    price FLOAT(6,2),
    img_sm VARCHAR(64),
    img_lg VARCHAR(64),
    detail VARCHAR(2048),
    intro VARCHAR(2048)
);
INSERT INTO case_dish(did,img_sm,img_lg,name,price,intro,detail) VALUES
(   null,
    'tlms_s.jpg',
    'tlms.jpg',
    '【意大利：提拉米苏(Tiramisu)】',
    109,
    '提拉米苏，亦译成堤拉米苏。是一种带咖啡酒味儿的蛋糕，由鲜奶油、可可粉、巧克力、面粉制成，最上面是薄薄的一层可可粉，下面是浓浓的奶油制品，而奶油中间是类似巧克力蛋糕般
的慕司。',
    '作为意大利甜点的代表，外貌绚丽、姿态娇媚的提拉米苏已经风靡全球。它以Espresso(特浓意大利咖啡)的苦、蛋与糖的润、甜酒的醇、巧克力的馥郁、手指饼干的绵密、乳酪和鲜奶油的稠香、可可粉的干爽，只用了不到十种材料，把“甜”以及甜所能唤起的种种错综复杂的体验，交糅着一层层演绎到极致。'
),
(   null,
    'sby_s.jpg',
    'sby.jpg',
    '【意大利：萨芭雍甜点(Sabayon)】',
    68,
    '萨芭雍是意大利的一种甜品，是用鸡蛋混合奶油，甜酒，浇在各式水果上著名的典型宫廷代表作。',
    '它是一道充满酒香、蛋香的意大利著名甜品，尤其浓稠柔细的蛋糊，覆盖于应季水果上，再加上微微烤过后的所散发出来的焦香。冷与热，甜蜜与新鲜，微薰与清洌之间的交揉，直叫人不饮也醉。在一片柔和的灯光下，伴随着和谐的音符，享受着萨芭雍所带来的恬静与淡雅，交杂着你的心境，你会感触萨芭雍所带来的许多许多。。'
),
(   null,
    'muc_s.jpg',
    'muc.jpg',
    '【法国：木材蛋糕(Yule log)】',
    133,
    'Yule 其实是耶诞节的旧称，从维京人到至今的冬季庆典。英格兰传统的耶诞节是在林子里砍柴拖曳回去放置在壁炉内，从耶诞平安夜开始燃烧12天，这木材就叫Yulelog(耶诞材)!',
    '木材蛋糕原本为法国人在度过耶诞节必备的应景年节点心。法国人在耶诞夜时，不管在哪里工作的游子都会赶忙回乡团聚，就象中国人守岁一样，有全家团圆守夜的习惯。当守到半夜的时候，通常会全家聚在暖炉前，一起吃木材蛋糕，配着咖啡或红茶，一面驱赶寒意，另一方面也借机联络家人间的感情。'
),
(   null,
    'saha_s.jpg',
    'saha.jpg',
    '【法国：撒哈蛋糕(Sachertorte)】',
    124,
    '特征是酒香浓郁，一般用朗姆酒，比如说国外的冰淇淋经常能看到各种萨芭雍的口味，比如巧克力撒哈，咖啡撒哈，樱桃撒哈。',
    '据说是在1832年，由澳大利亚驻法外交官梅兹提尔尼西的专任主厨，法国籍的撒哈所发明的，当年16岁。因外交官梅兹提尔尼西嗜好甜食，每天都必须品尝不同的甜点，结果撒哈试着将许多平常不常用于点心的食材加以组合，最后完成了这道撒哈蛋糕。后来在1876年，撒哈的儿子爱德华创立撒哈HOTEL，并与妻子安娜把这道点心加以发扬光大，成为法国着名的蛋糕之一。'
),
(   null,
    'shuful_s.jpg',
    'shuful.jpg',
    '【法国：舒芙蕾(Souffle)】',
    159,
    '用蛋白、杏仁粉、白砂糖和糖霜制作，并夹有水果酱或奶油的法式甜点。口感丰富，外脆内柔，外观五彩缤纷，精致小巧。',
    '老百姓们花在吃的时间比工作的时间多上好几倍，往往三、四个人的餐会，十几二十道菜，多得吃不完，吃到最后，宾客都仅意思意思地动动刀叉，浅尝即止;宴会结束后，一整个下午，只听见打饱嗝的声音此起彼落，这个「下午打嗝」的社会现象维持了整整半个世纪，直到引起社会清流人士如此的蜚短流长方才告一段落：连虚无也难逃物质化，并因过度膨胀而遭到倒塌的命运。为了矫正败坏的饮食风气，厨师们特地运用无滋无味无重的蛋白，变化成这道虚无的美食;然而，厨师们又害怕过度膨胀的虚无物质主义，又将如预言一般，终将难逃坍塌的命运，所以千方百计地想让舒芙里在送达客人食用之前，能保持优雅蓬松的原貌。'
),
(   null,
    'musi_s.jpg',
    'musi.jpg',
    '【法国：慕斯蛋糕(Mousse cake)】',
    239,
    '蛋糕极品—慕斯蛋糕：慕斯蛋糕最早起源于美食之都--法国巴黎。',
    '莎莉文慕斯在鲜奶油中加入具有口感和风味的十数种新鲜辅料，在温度的控制、原料的配比、PH值的掌握，都有十分严格的要求，使外型、色泽、结构变化丰富、口味更加自然纯正，冷冻后食用风味无穷，符合人们追求精致时尚、自然健康的生活理念、为蛋糕中的至尊极品。'
),
(   null,
    'oupeil_s.jpg',
    'oupeil.jpg',
    '【法国：欧培拉蛋糕(Opera)】',
    68,
    '有着数百年历史的蛋糕，里边那股浓郁的巧克力味与咖啡味令每个爱好巧克力与咖啡的人都迷恋不已。', 
    '说到法国甜点心，不得不提有百年历史的欧培拉OPERA。传统的欧培拉共有六层，包括三层浸过咖啡糖浆的海绵蛋糕，以及用牛油、鲜奶油和巧克力奶油做成的馅。整个蛋糕充满了咖啡与巧克力的香味，入口即化。每个喜欢巧克力的人一定会迷上它，那浓郁的巧克力与咖啡味，萦绕在舌尖，慢慢融化在口中,香味久久不能散去……这款蛋糕由1890年开业的Dalloyau 甜点店最先创制，由于形状正正方方，表面淋上一层薄薄的巧克力，就像歌剧院内的舞台，而蛋糕表面缀上一片金箔，象征歌剧院里的加尼叶(原是巴黎著名歌剧院的名字)，因此得名。'
),
(   null,
    'madel_s.jpg',
    'madel.jpg',
    '【法国：玛德莲贝壳甜点(Madeleine)】',
    198,
    '“那第一口浮有屑的温暖茶水在碰到味蕾的一瞬间，一阵战栗穿过全身，茶水和饼干屑的结合为他带来无上喜悦”。——普鲁斯特Marcel Proust。',
    '这句话就是在描写法国的玛德莲蛋糕。玛德莲蛋糕又称贝壳蛋糕，是最能代表法国的饼干之一，可是个人觉得它吃起来更像蛋糕一类的小点心。只是在法国传统意义上来说它归于饼干类。相传，玛德莲蛋糕源于法国洛林地区。十八世纪，洛林公爵在某次宴会上，因甜点师傅与大厨吵架，愤而离去。为顾全大局，一位名叫玛德莲的侍女便自告奋勇的烤了一大盘小蛋糕上桌，那诱人的香气与恰到好处的色泽让宾客们纷纷叫好，公爵便把这款点心命名为“玛德莲”。'
);

##SELECT * FROM case_dish;

/*用户表*/
CREATE TABLE case_users(
    userid INT PRIMARY KEY AUTO_INCREMENT, /*购物车编号*/
    uname VARCHAR(20),                     /*用户名*/
    pwd VARCHAR(20),                       /*密码*/
    phone VARCHAR(20)                      /*电话*/
);
INSERT INTO case_users VALUES
(NULL,'zhangsan','11111','13111112345'),
(NULL,'lisi','22222','13819196547'),
(NULL,'王五','33333','13819196547');

/*订单表*/
CREATE TABLE case_order(
    oid INT PRIMARY KEY AUTO_INCREMENT,     /*订单ID*/
    userid INT,                             /*用户*/
    phone VARCHAR(16),                      /*联系电话*/
    user_name VARCHAR(16),                  /*收货方用户名*/
    order_time LONG,                        /*下单时间*/
    addr VARCHAR(256),                      /*订单地址*/
    totalprice FLOAT(6,2)                   /*订单总价*/
);
INSERT INTO case_order VALUES
(NULL,1,'13501234567','大大',1445154859209,'迎春南街5号',20.5),
(NULL,1,'13501257543','琳妹妹',1445154997543,'迎春南街5号',12.5),
(NULL,2,'13207654321','小小',1445254997612,'迎春南街5号',55),
(NULL,2,'13899999999','文兄',1445354959209,'迎春南街5号',35),
(NULL,3,'13683675299','梅姐',1445355889209,'迎春南街5号',45);


##SELECT * FROM case_order;
/**购物车表**/
CREATE TABLE case_cart(
    ctid INT PRIMARY KEY AUTO_INCREMENT, /*购物车编号*/
    userid INT,                          /*用户编号：假定有用户id为 1 和 3 的两个用户有数据*/
    did INT,                             /*产品编号*/
    dishCount INT                      /*数量*/
);
INSERT INTO case_cart VALUES (null,1,1,1),
(null,1,2,4),
(null,1,5,2),
(null,3,2,10),
(null,3,6,1);
##SELECT * FROM case_cart;
/**订单详情表**/
CREATE TABLE case_orderdetails(
    oid INT ,                            /*订单编号*/
    did INT,                             /*产品id*/
    dishCount INT,                     /*购买数量*/
    price FLOAT(8,2)                     /*产品单价：需要记载，因为产品价格可能波动*/
);
INSERT INTO case_orderdetails VALUES (1,1,2,5),
(1,2,1,10.5),
(2,3,1,12.5),
(3,1,3,5),
(3,2,4,10),
(4,4,7,5),
(5,5,5,4),
(5,6,2,12.5);